Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack/wiced_include/wiced_bt_avrc_defs.h
/*
 * Copyright 2016-2022, Cypress Semiconductor Corporation or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file
 *
 * Bluetooth AVRCP Definition and Data Types
 *
 */
#pragma once

#ifdef __cplusplus
extern "C"
{
#endif

/**
 * @cond DUAL_MODE
 * @defgroup  wicedbt_avrc        Audio/Video Remote Control (AVRC)
 *
 * This section describes the API's to use Audio/Video Remote Control Profile.
 * The AVRC profile defines the procedures required to control audio/video functions
 * of Bluetooth devices.
 *
 * @addtogroup  wicedbt_avrc    Audio/Video Remote Control (AVRC)
 *
 * @ingroup     wicedbt
 *
 * @{
*/


/*****************************************************************************
**  constants
*****************************************************************************/
/**
 * @anchor AVRC_PROFILE_VERSIONS
 * @name AVRC profile version
 * @{ */
#define AVRC_REV_1_0        0x0100  /**< AVRC profile version 1.0*/
#define AVRC_REV_1_3        0x0103  /**< AVRC profile version 1.3*/
#define AVRC_REV_1_4        0x0104  /**< AVRC profile version 1.4*/
#define AVRC_REV_1_5        0x0105  /**< AVRC profile version 1.5*/
#define AVRC_REV_1_6        0x0106  /**< AVRC profile version 1.6*/

/** @} AVRC_PROFILE_VERSIONS */
#define AVRC_PACKET_LEN             512 /**< AVRC packet length, you must support 512 byte RC packets */

#define AVRC_MIN_CONTROL_MTU        48  /**< Per the spec, minimum MTU for the control channel */
#define AVRC_MIN_BROWSE_MTU         335 /**< Per the spec, minimum MTU for the browsing channel */

#define AVRC_META_PDU_OFFSET        4   /**< AVRC Metadata packet PDU offset*/
#define AVRC_SUB_TYPE_LEN           4   /**< AVRC subunit type length*/
#define AVRC_UID_SIZE               8   /**< AVRC UID size*/
#define AVRC_FEATURE_MASK_SIZE      16  /**< AVRC feature mask size*/

/**
 * @anchor AVRC_SUBUNIT_TYPE
 * @name AVRC subunit types
 * @{ */
#define AVRC_SUB_MONITOR    0x00    /**< Monitor */
#define AVRC_SUB_AUDIO      0x01    /**< Audio */
#define AVRC_SUB_PRINTER    0x02    /**< Printer */
#define AVRC_SUB_DISC       0x03    /**< Disc */
#define AVRC_SUB_TAPE       0x04    /**< Tape recorder/player */
#define AVRC_SUB_TUNER      0x05    /**< Tuner */
#define AVRC_SUB_CA         0x06    /**< CA */
#define AVRC_SUB_CAMERA     0x07    /**< Camera */
#define AVRC_SUB_PANEL      0x09    /**< Panel */
#define AVRC_SUB_BB         0x0A    /**< Bulletin Board */
#define AVRC_SUB_CAM_STOR   0x0B    /**< Camera Storage */
#define AVRC_SUB_VENDOR     0x1C    /**< Vendor unique */
#define AVRC_SUB_EXT        0x1E    /**< Subunit type extended to next byte */
#define AVRC_SUB_UNIT       0x1F    /**< Unit */
/** @} AVRC_SUBUNIT_TYPE */

/**
 * @anchor AVRC_OPCODES
 * @name AVRC message opcodes (defined by 1394ta).
 * @{
 */
#define AVRC_OP_UNIT_INFO   0x30    /**< Report unit information */
#define AVRC_OP_SUB_INFO    0x31    /**< Report subunit information */
#define AVRC_OP_VENDOR      0x00    /**< Vendor-dependent commands */
#define AVRC_OP_PASS_THRU   0x7C    /**< panel subunit opcode */
/** opcodes 80-9F and E0-FF are not used by 1394ta.Sneak one for the browsing channel */
#define AVRC_OP_BROWSE      0xFF    /**< Browsing */
#define AVRC_OP_INVALID     0xFE    /**< Invalid  */
/** @} AVRC_OPCODES */


/**
 * @anchor AVRC_COMPANY_ID
 * @name Company IDs
 * @{ */
#define AVRC_CO_BLUETOOTH_SIG   0x00FFFFFF  /**< Bluetooth SIG */
#define AVRC_CO_WIDCOMM         0x00000361  /**< Widcomm Inc. */
#define AVRC_CO_BROADCOM        0x00001018  /**< Broadcom */
#define AVRC_CO_METADATA        0x00001958  /**< AVRC metadata messages */
/** @} AVRC_COMPANY_ID */

/** State flag for Passthrough commands
*/
#define AVRC_STATE_PRESS    0   /**< AVRC button state press*/
#define AVRC_STATE_RELEASE  1   /**< AVRC button state release*/

/**
 * @anchor AVRC_OPERATION_ID_LIST
 * @name Operation ID list for Passthrough commands
 * @{ */
#define AVRC_ID_SELECT      0x00    /**< select */
#define AVRC_ID_UP          0x01    /**< up */
#define AVRC_ID_DOWN        0x02    /**< down */
#define AVRC_ID_LEFT        0x03    /**< left */
#define AVRC_ID_RIGHT       0x04    /**< right */
#define AVRC_ID_RIGHT_UP    0x05    /**< right-up */
#define AVRC_ID_RIGHT_DOWN  0x06    /**< right-down */
#define AVRC_ID_LEFT_UP     0x07    /**< left-up */
#define AVRC_ID_LEFT_DOWN   0x08    /**< left-down */
#define AVRC_ID_ROOT_MENU   0x09    /**< root menu */
#define AVRC_ID_SETUP_MENU  0x0A    /**< setup menu */
#define AVRC_ID_CONT_MENU   0x0B    /**< contents menu */
#define AVRC_ID_FAV_MENU    0x0C    /**< favorite menu */
#define AVRC_ID_EXIT        0x0D    /**< exit */
#define AVRC_ID_0           0x20    /**< 0 */
#define AVRC_ID_1           0x21    /**< 1 */
#define AVRC_ID_2           0x22    /**< 2 */
#define AVRC_ID_3           0x23    /**< 3 */
#define AVRC_ID_4           0x24    /**< 4 */
#define AVRC_ID_5           0x25    /**< 5 */
#define AVRC_ID_6           0x26    /**< 6 */
#define AVRC_ID_7           0x27    /**< 7 */
#define AVRC_ID_8           0x28    /**< 8 */
#define AVRC_ID_9           0x29    /**< 9 */
#define AVRC_ID_DOT         0x2A    /**< dot */
#define AVRC_ID_ENTER       0x2B    /**< enter */
#define AVRC_ID_CLEAR       0x2C    /**< clear */
#define AVRC_ID_CHAN_UP     0x30    /**< channel up */
#define AVRC_ID_CHAN_DOWN   0x31    /**< channel down */
#define AVRC_ID_PREV_CHAN   0x32    /**< previous channel */
#define AVRC_ID_SOUND_SEL   0x33    /**< sound select */
#define AVRC_ID_INPUT_SEL   0x34    /**< input select */
#define AVRC_ID_DISP_INFO   0x35    /**< display information */
#define AVRC_ID_HELP        0x36    /**< help */
#define AVRC_ID_PAGE_UP     0x37    /**< page up */
#define AVRC_ID_PAGE_DOWN   0x38    /**< page down */
#define AVRC_ID_POWER       0x40    /**< power */
#define AVRC_ID_VOL_UP      0x41    /**< volume up */
#define AVRC_ID_VOL_DOWN    0x42    /**< volume down */
#define AVRC_ID_MUTE        0x43    /**< mute */
#define AVRC_ID_PLAY        0x44    /**< play */
#define AVRC_ID_STOP        0x45    /**< stop */
#define AVRC_ID_PAUSE       0x46    /**< pause */
#define AVRC_ID_RECORD      0x47    /**< record */
#define AVRC_ID_REWIND      0x48    /**< rewind */
#define AVRC_ID_FAST_FOR    0x49    /**< fast forward */
#define AVRC_ID_EJECT       0x4A    /**< eject */
#define AVRC_ID_FORWARD     0x4B    /**< forward */
#define AVRC_ID_BACKWARD    0x4C    /**< backward */
#define AVRC_ID_ANGLE       0x50    /**< angle */
#define AVRC_ID_SUBPICT     0x51    /**< subpicture */
#define AVRC_ID_F1          0x71    /**< F1 */
#define AVRC_ID_F2          0x72    /**< F2 */
#define AVRC_ID_F3          0x73    /**< F3 */
#define AVRC_ID_F4          0x74    /**< F4 */
#define AVRC_ID_F5          0x75    /**< F5 */
#define AVRC_ID_VENDOR      0x7E    /**< vendor unique */
#define AVRC_KEYPRESSED_RELEASE 0x80 /**< Keypressed_release */
 /** @} AVRC_OPERATION_ID_LIST*/

/*****************************************************************************
**  Metadata transfer definitions
*****************************************************************************/

/**
 * @anchor AVRC_PACKET_TYPES
 * @name Define the Metadata Packet types
 * @{ */
#define AVRC_PKT_SINGLE           0 /**<AVRCP packet type single*/
#define AVRC_PKT_START            1 /**<AVRCP packet type start*/
#define AVRC_PKT_CONTINUE         2 /**<AVRCP packet type continue*/
#define AVRC_PKT_END              3 /**<AVRCP packet type end*/
#define AVRC_PKT_TYPE_MASK        3 /**<AVRCP packet type mask*/
/** @}AVRC_PACKET_TYPES*/


/** Define the PDUs carried in the vendor dependant data
*/
/**
 * @anchor AVRC_COMMAND_TYPES
 * @name Define the various AVRCP commands carried in the vendor dependant data
 * @{ */

