Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack/wiced_include/wiced_bt_avrc_defs.h
#define AVRC_PDU_GET_CAPABILITIES               0x10    /**<AVRCP pdu id for Get Capabilities*/
#define AVRC_PDU_LIST_PLAYER_APP_ATTR           0x11    /**<AVRCP pdu id for list player app attributes*/
#define AVRC_PDU_LIST_PLAYER_APP_VALUES         0x12    /**<AVRCP pdu id for list player app values*/
#define AVRC_PDU_GET_CUR_PLAYER_APP_VALUE       0x13    /**<AVRCP pdu id for get current player app value*/
#define AVRC_PDU_SET_PLAYER_APP_VALUE           0x14    /**<AVRCP pdu id for set player app value*/
#define AVRC_PDU_GET_PLAYER_APP_ATTR_TEXT       0x15    /**<AVRCP pdu id for get player app attribute text*/
#define AVRC_PDU_GET_PLAYER_APP_VALUE_TEXT      0x16    /**<AVRCP pdu id for get player app value text*/
#define AVRC_PDU_INFORM_DISPLAY_CHARSET         0x17    /**<AVRCP pdu id for inform display character set*/
#define AVRC_PDU_INFORM_BATTERY_STAT_OF_CT      0x18    /**<AVRCP pdu id for inform battery status of CT*/
#define AVRC_PDU_GET_ELEMENT_ATTR               0x20    /**<AVRCP pdu id for get element attributes*/
#define AVRC_PDU_GET_PLAY_STATUS                0x30    /**<AVRCP pdu id for get play status*/
#define AVRC_PDU_REGISTER_NOTIFICATION          0x31    /**<AVRCP pdu id for register notification*/
#define AVRC_PDU_REQUEST_CONTINUATION_RSP       0x40    /**<AVRCP pdu id for request continuation response*/
#define AVRC_PDU_ABORT_CONTINUATION_RSP         0x41    /**<AVRCP pdu id for abort continuation response*/
/** added in 1.4 */
#define AVRC_PDU_SET_ABSOLUTE_VOLUME            0x50    /**<AVRCP pdu id for set absolute volume*/
#define AVRC_PDU_SET_ADDRESSED_PLAYER           0x60    /**<AVRCP pdu id for set addressed player*/
#define AVRC_PDU_SET_BROWSED_PLAYER             0x70    /**<AVRCP pdu id for set browsed player*/
#define AVRC_PDU_GET_FOLDER_ITEMS               0x71    /**<AVRCP pdu id for get folder items*/
#define AVRC_PDU_CHANGE_PATH                    0x72    /**<AVRCP pdu id for change path*/
#define AVRC_PDU_GET_ITEM_ATTRIBUTES            0x73    /**<AVRCP pdu id for get item attributes*/
#define AVRC_PDU_PLAY_ITEM                      0x74    /**<AVRCP pdu id for play item*/
#define AVRC_PDU_GET_TOTAL_NUM_OF_ITEMS         0x75    /**<AVRCP pdu id for get total number of items*/
#define AVRC_PDU_SEARCH                         0x80    /**<AVRCP pdu id for search*/
#define AVRC_PDU_ADD_TO_NOW_PLAYING             0x90    /**<AVRCP pdu id for add to now playing*/
#define AVRC_PDU_GENERAL_REJECT                 0xA0    /**<AVRCP pdu id for general reject*/

/** Define the vendor unique id carried in the pass through data
*/
#define AVRC_PDU_NEXT_GROUP                     0x00    /**<AVRCP pdu id for next group*/
#define AVRC_PDU_PREV_GROUP                     0x01    /**<AVRCP pdu id for previous group*/
/**@}AVRC_COMMAND_TYPES*/
/** the only pass through vendor unique commands defined by AVRC is the group navigation commands
 * The len for vendor unique data is 5 */
#define AVRC_PASS_THRU_GROUP_LEN                5/**< AVRC group navigation command len*/

/**
 * @anchor AVRC_STS
 * @name AVRC status codes.
 * @{
 */
 /* 6.15.3 error status code for general reject */
#define AVRC_STS_BAD_CMD        0x00    /**< Invalid command, sent if TG received a PDU that it did not understand. */
#define AVRC_STS_BAD_PARAM      0x01    /**< Invalid parameter, sent if the TG received a PDU with a parameter ID that it did not understand. Sent if there is only one parameter ID in the PDU. */
#define AVRC_STS_NOT_FOUND      0x02    /**< Specified parameter not found., sent if the parameter ID is understood, but content is wrong or corrupted. */
#define AVRC_STS_INTERNAL_ERR   0x03    /**< Internal Error, sent if there are error conditions not covered by a more specific error code. */
#define AVRC_STS_NO_ERROR       0x04    /**< Operation completed without error.  This is the status that should be returned if the operation was successful. */
#define AVRC_STS_UID_CHANGED    0x05    /**< UID Changed - The UIDs on the device have changed */
/* #define AVRC_STS_GEN_ERROR      0x06    Unknown Error - this is changed to "reserved" */
#define AVRC_STS_BAD_DIR        0x07    /**< Invalid Direction - The Direction parameter is invalid - Change Path*/
#define AVRC_STS_NOT_DIR        0x08    /**< Not a Directory - The UID provided does not refer to a folder item  Change Path*/
#define AVRC_STS_NOT_EXIST      0x09    /**< Does Not Exist - The UID provided does not refer to any item    Change Path, PlayItem, AddToNowPlaying, GetItemAttributes*/
#define AVRC_STS_BAD_SCOPE      0x0a    /**< Invalid Scope - The scope parameter is invalid  GetFolderItems, PlayItem, AddToNowPlayer, GetItemAttributes, */
#define AVRC_STS_BAD_RANGE      0x0b    /**< Range Out of Bounds - The start of range provided is not valid  GetFolderItems*/
#define AVRC_STS_UID_IS_DIR     0x0c    /**< UID is a Directory - The UID provided refers to a directory, which cannot be handled by this media player   PlayItem, AddToNowPlaying */
#define AVRC_STS_IN_USE         0x0d    /**< Media in Use - The media is not able to be used for this operation at this time PlayItem, AddToNowPlaying */
#define AVRC_STS_NOW_LIST_FULL  0x0e    /**< Now Playing List Full - No more items can be added to the Now Playing List  AddToNowPlaying*/
#define AVRC_STS_SEARCH_NOT_SUP 0x0f    /**< Search Not Supported - The Browsed Media Player does not support search Search */
#define AVRC_STS_SEARCH_BUSY    0x10    /**< Search in Progress - A search operation is already in progress  Search*/
#define AVRC_STS_BAD_PLAYER_ID  0x11    /**< Invalid Player Id - The specified Player Id does not refer to a valid player    SetAddressedPlayer, SetBrowsedPlayer*/
#define AVRC_STS_PLAYER_N_BR    0x12    /**< Player Not Browsable - The Player Id supplied refers to a Media Player which does not support browsing. SetBrowsedPlayer */
#define AVRC_STS_PLAYER_N_ADDR  0x13    /**< Player Not Addressed.  The Player Id supplied refers to a player which is not currently addressed, and the command is not able to be performed if the player is not set as addressed.   Search, SetBrowsedPlayer*/
#define AVRC_STS_BAD_SEARCH_RES 0x14    /**< No valid Search Results - The Search result list does not contain valid entries, e.g. after being invalidated due to change of browsed player   GetFolderItems */
#define AVRC_STS_NO_AVAL_PLAYER 0x15    /**< No available players ALL */
#define AVRC_STS_ADDR_PLAYER_CHG 0x16   /**< Addressed Player Changed - Register Notification */
#define AVRC_STS_NO_RESOURCES   0x17    /**< No respouces available  */

typedef uint8_t wiced_bt_avrc_sts_t;    /**<AVRC sts */
/** @} AVRC_STS */

