Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack/wiced_include/wiced_bt_avrc_defs.h
/** Define the Capability IDs
*/
/**
 * @anchor AVRC_CAPABILITY_IDS
 * @name AVRC capability ids.
 * @{
 */
#define AVRC_CAP_COMPANY_ID                     0x02    /**<Capability id for company*/
#define AVRC_CAP_EVENTS_SUPPORTED               0x03    /**<Capability id for events supported*/
#define AVRC_COMPANY_ID_LEN                     3       /**<company id len*/
#define AVRC_CAPABILITY_OFFSET                  2       /**<capability offset*/
/**@}AVRC_CAPABILITY_IDS*/

/**
 * @anchor AVRC_PLAYER_SETTINGS
 * @name AVRC player settings ids
 * @{
 */
#define AVRC_PLAYER_SETTING_EQUALIZER           0x01    /**<id for equalizer*/
#define AVRC_PLAYER_SETTING_REPEAT              0x02    /**<id for repeat*/
#define AVRC_PLAYER_SETTING_SHUFFLE             0x03    /**<id for shuffle*/
#define AVRC_PLAYER_SETTING_SCAN                0x04    /**<id for scan*/
#define AVRC_PLAYER_SETTING_LOW_MENU_EXT        0x80    /**<id for low menu exit*/
#define AVRC_PLAYER_SETTING_HIGH_MENU_EXT       0xff    /**<id for high menu exit*/
/**@}AVRC_PLAYER_SETTINGS*/

/**
 * @anchor AVRC_PLAYER_SETTINGS_VALS
 * @name possible values of the Player Application Settings
 * @{
 */

#define AVRC_PLAYER_VAL_OFF                     0x01        /**<value for off*/
#define AVRC_PLAYER_VAL_ON                      0x02        /**<value for on*/
#define AVRC_PLAYER_VAL_SINGLE_REPEAT           0x02        /**<value for single repeat*/
#define AVRC_PLAYER_VAL_ALL_REPEAT              0x03        /**<value for all repeat*/
#define AVRC_PLAYER_VAL_GROUP_REPEAT            0x04        /**<value for group repeat*/
#define AVRC_PLAYER_VAL_ALL_SHUFFLE             0x02        /**<value for all shuffle*/
#define AVRC_PLAYER_VAL_GROUP_SHUFFLE           0x03        /**<value for group shuffle*/
#define AVRC_PLAYER_VAL_ALL_SCAN                0x02        /**<value for all scan*/
#define AVRC_PLAYER_VAL_GROUP_SCAN              0x03        /**<value for group scan*/
/**@}AVRC_PLAYER_SETTINGS_VALS*/

/**
 * @anchor AVRC_BATTERY_STATUS_PDU
 * @name possible values of the Battery Status PDU
 * @{
 */

#define AVRC_BATTERY_STATUS_NORMAL              0x00    /**<battery status normal */
#define AVRC_BATTERY_STATUS_WARNING             0x01    /**<battery status warning */
#define AVRC_BATTERY_STATUS_CRITICAL            0x02    /**<battery status critical */
#define AVRC_BATTERY_STATUS_EXTERNAL            0x03    /**<battery status external */
#define AVRC_BATTERY_STATUS_FULL_CHARGE         0x04    /**<battery status full charge */
typedef uint8_t wiced_bt_avrc_battery_status_t; /**<AVRC battery*/
/**@}AVRC_BATTERY_STATUS_PDU*/

#define AVRC_CHAR_SET_SIZE                      2/**< Define character set */

/**
 * @anchor AVRC_MEDIA_ATTR_IDS
 * @name  media attribute ids
 * @{
 */

#define AVRC_MEDIA_ATTR_ID_TITLE                 0x00000001 /**< Attribute id for title*/
#define AVRC_MEDIA_ATTR_ID_ARTIST                0x00000002 /**< Attribute id for artist*/
#define AVRC_MEDIA_ATTR_ID_ALBUM                 0x00000003 /**< Attribute id for album*/
#define AVRC_MEDIA_ATTR_ID_TRACK_NUM             0x00000004 /**< Attribute id for track number*/
#define AVRC_MEDIA_ATTR_ID_NUM_TRACKS            0x00000005 /**< Attribute id for number of tracks*/
#define AVRC_MEDIA_ATTR_ID_GENRE                 0x00000006 /**< Attribute id for genre*/
#define AVRC_MEDIA_ATTR_ID_PLAYING_TIME          0x00000007 /**< Attribute id for playing time*/
#define AVRC_MAX_NUM_MEDIA_ATTR_ID               7          /**< Number of media attribute ids*/
/**@}AVRC_MEDIA_ATTR_IDS*/

/**
 * @anchor AVRC_PLAY_STATE
 * @name  Play state values
 * @{
 */
#define AVRC_PLAYSTATE_RESP_MSG_SIZE            9       /**< play state response msg size */
#define AVRC_PLAYSTATE_STOPPED                  0x00    /**< Stopped */
#define AVRC_PLAYSTATE_PLAYING                  0x01    /**< Playing */
#define AVRC_PLAYSTATE_PAUSED                   0x02    /**< Paused  */
#define AVRC_PLAYSTATE_FWD_SEEK                 0x03    /**< Fwd Seek*/
#define AVRC_PLAYSTATE_REV_SEEK                 0x04    /**< Rev Seek*/
#define AVRC_PLAYSTATE_ERROR                    0xFF    /**< Error   */
typedef uint8_t wiced_bt_avrc_playstate_t;  /**<AVRC playstate*/
/**@}AVRC_PLAY_STATE*/


/**
 * @anchor AVRC_EVENTS
 * @name  Events that can be registered for notifications
 * @{
 */
#define AVRC_EVT_PLAY_STATUS_CHANGE             0x01    /**< play status changed event */
#define AVRC_EVT_TRACK_CHANGE                   0x02    /**< track changed event*/
#define AVRC_EVT_TRACK_REACHED_END              0x03    /**< track reached end event*/
#define AVRC_EVT_TRACK_REACHED_START            0x04    /**< track reach start event*/
#define AVRC_EVT_PLAY_POS_CHANGED               0x05    /**< playback position changed event*/
#define AVRC_EVT_BATTERY_STATUS_CHANGE          0x06    /**< battery status changed event*/
#define AVRC_EVT_SYSTEM_STATUS_CHANGE           0x07    /**< system status changed event*/
#define AVRC_EVT_APP_SETTING_CHANGE             0x08    /**< app settings change event*/
#define AVRC_EVT_NOW_PLAYING_CHANGE             0x09    /**< now playing changed event*/
#define AVRC_EVT_AVAL_PLAYERS_CHANGE            0x0a    /**< available players changed event*/
#define AVRC_EVT_ADDR_PLAYER_CHANGE             0x0b    /**< addressed player changed event*/
#define AVRC_EVT_UIDS_CHANGE                    0x0c    /**< UIDs changed events*/
#define AVRC_EVT_VOLUME_CHANGE                  0x0d    /**< volume changed event*/
/**@}AVRC_EVENTS*/


#define AVRC_NUM_NOTIF_EVENTS                   0x0d    /**< the number of events that can be registered for notifications */

#define AVRC_EVT_MSG_LEN_1                      0x01    /**< Msg len 1*/
#define AVRC_EVT_MSG_LEN_2                      0x02    /**< Msg len 2*/
#define AVRC_EVT_MSG_LEN_5                      0x05    /**< Msg len 5*/
#define AVRC_EVT_MSG_LEN_9                      0x09    /**< Msg len 9*/

#define AVRC_MAX_VOLUME                         0x7F    /**< AVRC max volume*/

/** Define the possible values of system status
*/
#define AVRC_SYSTEMSTATE_PWR_ON                 0x00    /**< AVRC system power on state*/
#define AVRC_SYSTEMSTATE_PWR_OFF                0x01    /**< AVRC system power off state*/
#define AVRC_SYSTEMSTATE_PWR_UNPLUGGED          0x02    /**< AVRC system power unplugged state*/
typedef uint8_t wiced_bt_avrc_systemstate_t;    /**<AVRC systemstate*/

