Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack/wiced_include/wiced_bt_avrc_defs.h
/** the frequently used character set ids */
#define AVRC_CHARSET_ID_ASCII                  ((uint16_t) 0x0003) /**< ASCII */
#define AVRC_CHARSET_ID_UTF8                   ((uint16_t) 0x006a) /**< UTF-8 */
#define AVRC_CHARSET_ID_UTF16                  ((uint16_t) 0x03f7) /**< 1015 */
#define AVRC_CHARSET_ID_UTF32                  ((uint16_t) 0x03f9) /**< 1017 */

/*****************************************************************************
**  Advanced Control
*****************************************************************************/
#define AVRC_ITEM_PLAYER            0x01    /**< AVRC player item */
#define AVRC_ITEM_FOLDER            0x02    /**< AVRC folder item */
#define AVRC_ITEM_MEDIA             0x03    /**< AVRC media item */

#define AVRC_SCOPE_PLAYER_LIST      0x00  /**< Media Player Item - Contains all available media players */
#define AVRC_SCOPE_FILE_SYSTEM      0x01  /**< Folder Item, Media Element Item- The virtual filesystem containing the media content of the browsed player */
#define AVRC_SCOPE_SEARCH           0x02  /**< Media Element Item  The results of a search operation on the browsed player */
#define AVRC_SCOPE_NOW_PLAYING      0x03  /**< Media Element Item  The Now Playing list (or queue) of the addressed player */

#define AVRC_FOLDER_ITEM_COUNT_NONE 0xFF    /**< foler item count none */

/** folder types */
#define AVRC_FOLDER_TYPE_MIXED      0x00    /**< mixed*/
#define AVRC_FOLDER_TYPE_TITLES     0x01    /**< titles*/
#define AVRC_FOLDER_TYPE_ALNUMS     0x02    /**< albums*/
#define AVRC_FOLDER_TYPE_ARTISTS    0x03    /**< artists*/
#define AVRC_FOLDER_TYPE_GENRES     0x04    /**< genres*/
#define AVRC_FOLDER_TYPE_PLAYLISTS  0x05    /**< playlists*/
#define AVRC_FOLDER_TYPE_YEARS      0x06    /**< years*/

/** major player type */
#define AVRC_PLAYER_MAJOR_TYPE_AUDIO          0x01  /**< Audio */
#define AVRC_PLAYER_MAJOR_TYPE_VIDEO          0x02  /**< Video */
#define AVRC_PLAYER_MAJOR_TYPE_BC_AUDIO       0x04  /**< Broadcasting Audio */
#define AVRC_PLAYER_MAJOR_TYPE_BC_VIDEO       0x08  /**< Broadcasting Video */
#define AVRC_PLAYER_MAJOR_TYPE_INVALID        0xF0  /**< Invalid*/

/** player sub type */
#define AVRC_PLAYER_SUB_TYPE_NONE          0x00  /**< None*/
#define AVRC_PLAYER_SUB_TYPE_AUDIO_BOOK    0x01  /**< Audio Book */
#define AVRC_PLAYER_SUB_TYPE_PODCAST       0x02  /**< Podcast */
#define AVRC_PLAYER_SUB_TYPE_INVALID       0xFC  /**< invalid*/

/** media item - media type */
#define AVRC_MEDIA_TYPE_AUDIO       0x00    /**< Audio */
#define AVRC_MEDIA_TYPE_VIDEO       0x01    /**< video */

#define AVRC_DIR_UP                 0x00  /**< Folder Up */
#define AVRC_DIR_DOWN               0x01  /**< Folder Down */

#define AVRC_UID_SIZE               8   /**< Avrc uid size */
typedef uint8_t wiced_bt_avrc_uid_t[AVRC_UID_SIZE]; /**<AVRC UID*/

/**  player attribute - supported features
*****************************************************************************/
#define AVRC_PF_SELECT_BIT_NO           0 /**< Bit for select*/
#define AVRC_PF_SELECT_MASK             0x01    /**< mask for select*/
#define AVRC_PF_SELECT_OFF              0       /**<Value when select is off*/
#define AVRC_PF_SELECT_SUPPORTED(x)     ((x)[AVRC_PF_SELECT_OFF] & AVRC_PF_SELECT_MASK) /**<check for select feature enabled/disabled*/

#define AVRC_PF_UP_BIT_NO               1       /**< bit for UP*/
#define AVRC_PF_UP_MASK                 0x02    /**< mask for UP*/
#define AVRC_PF_UP_OFF                  0       /**< value when UP is off*/
#define AVRC_PF_UP_SUPPORTED(x)         ((x)[AVRC_PF_UP_OFF] & AVRC_PF_UP_MASK) /**<check for UP feature enabled/disabled*/

#define AVRC_PF_DOWN_BIT_NO             2       /**<Bit for DOWN*/
#define AVRC_PF_DOWN_MASK               0x04    /**<Mask for DOWN*/
#define AVRC_PF_DOWN_OFF                0       /**<value when DOWN is off*/
#define AVRC_PF_DOWN_SUPPORTED(x)       ((x)[AVRC_PF_DOWN_OFF] & AVRC_PF_DOWN_MASK)/**<check for DOWN feature enabled/disabled*/

#define AVRC_PF_LEFT_BIT_NO             3       /**<Bit for LEFT*/
#define AVRC_PF_LEFT_MASK               0x08    /**<Mask for LEFT*/
#define AVRC_PF_LEFT_OFF                0       /**<Value when LEFT is OFF*/
#define AVRC_PF_LEFT_SUPPORTED(x)       ((x)[AVRC_PF_LEFT_OFF] & AVRC_PF_LEFT_MASK)/**<check for LEFT feature enabled/disabled*/

#define AVRC_PF_RIGHT_BIT_NO            4       /**<Bit for RIGHT*/
#define AVRC_PF_RIGHT_MASK              0x10    /**<Mask for RIGHT*/
#define AVRC_PF_RIGHT_OFF               0       /**<Value when RIGHT is OFF*/
#define AVRC_PF_RIGHT_SUPPORTED(x)      ((x)[AVRC_PF_RIGHT_OFF] & AVRC_PF_RIGHT_MASK)/**<check for RIGHT feature enabled/disabled*/

#define AVRC_PF_RIGHTUP_BIT_NO          5       /**<Bit for RIGHTUP*/
#define AVRC_PF_RIGHTUP_MASK            0x20    /**<Mask for RIGHTUP*/
#define AVRC_PF_RIGHTUP_OFF             0       /**<Value when RIGHTUP is off*/
#define AVRC_PF_RIGHTUP_SUPPORTED(x)    ((x)[AVRC_PF_RIGHTUP_OFF] & AVRC_PF_RIGHTUP_MASK)/**<check for RIGHTUP feature enabled/disabled*/

#define AVRC_PF_RIGHTDOWN_BIT_NO        6       /**<Bit for RIGHTDOWN*/
#define AVRC_PF_RIGHTDOWN_MASK          0x40    /**<Mask for RIGHTDOWN*/
#define AVRC_PF_RIGHTDOWN_OFF           0       /**<value when RIGHTDOWN is off*/
#define AVRC_PF_RIGHTDOWN_SUPPORTED(x)  ((x)[AVRC_PF_RIGHTDOWN_OFF] & AVRC_PF_RIGHTDOWN_MASK)/**<check for RIGHTDOWN feature enabled/disabled*/

#define AVRC_PF_LEFTUP_BIT_NO           7       /**<bit for LEFTUP*/
#define AVRC_PF_LEFTUP_MASK             0x80    /**<mask for LEFTUP*/
#define AVRC_PF_LEFTUP_OFF              0       /**<value when LEFTUP is OFF*/
#define AVRC_PF_LEFTUP_SUPPORTED(x)     ((x)[AVRC_PF_LEFTUP_OFF] & AVRC_PF_LEFTUP_MASK)/**<check for LEFTUP feature enabled/disabled*/

#define AVRC_PF_LEFTDOWN_BIT_NO         8       /**<Bit for LEFTDOWN*/
#define AVRC_PF_LEFTDOWN_MASK           0x01    /**<Mask for LEFTDOWN*/
#define AVRC_PF_LEFTDOWN_OFF            1       /**<value when LEFTDOWN is off */
#define AVRC_PF_LEFTDOWN_SUPPORTED(x)   ((x)[AVRC_PF_LEFTDOWN_OFF] & AVRC_PF_LEFTDOWN_MASK)/**<check for LEFTDOWN feature enabled/disabled*/

#define AVRC_PF_ROOT_MENU_BIT_NO        9       /**<Bit for Root menu*/
#define AVRC_PF_ROOT_MENU_MASK          0x02    /**<Mask for Root menu*/
#define AVRC_PF_ROOT_MENU_OFF           1       /**<Value when Root menu is off*/
#define AVRC_PF_ROOT_MENU_SUPPORTED(x)  ((x)[AVRC_PF_ROOT_MENU_OFF] & AVRC_PF_ROOT_MENU_MASK)/**<check for ROOT menu feature enabled/disabled*/

#define AVRC_PF_SETUP_MENU_BIT_NO       10      /**<Bit for setup*/
#define AVRC_PF_SETUP_MENU_MASK         0x04    /**<mask for setup */
#define AVRC_PF_SETUP_MENU_OFF          1       /**< value when setup is off*/
#define AVRC_PF_SETUP_MENU_SUPPORTED(x) ((x)[AVRC_PF_SETUP_MENU_OFF] & AVRC_PF_SETUP_MENU_MASK)/**<check for SETUP feature enabled/disabled*/

#define AVRC_PF_CONTENTS_MENU_BIT_NO    11      /**<bit for contents menu*/
#define AVRC_PF_CONTENTS_MENU_MASK      0x08    /**<mask for contents menu*/
#define AVRC_PF_CONTENTS_MENU_OFF       1       /**<value when contents menu is off */
#define AVRC_PF_CONTENTS_MENU_SUPPORTED(x)  ((x)[AVRC_PF_CONTENTS_MENU_OFF] & AVRC_PF_CONTENTS_MENU_MASK)/**<check for Contents menu feature enabled/disabled*/

#define AVRC_PF_FAVORITE_MENU_BIT_NO    12      /**<bit for Favorite menu*/
#define AVRC_PF_FAVORITE_MENU_MASK      0x10    /**<Mask for favorite menu*/
#define AVRC_PF_FAVORITE_MENU_OFF       1       /**<value when favorite menu is off */
#define AVRC_PF_FAVORITE_MENU_SUPPORTED(x)  ((x)[AVRC_PF_FAVORITE_MENU_OFF] & AVRC_PF_FAVORITE_MENU_MASK)/**<check for Favorite feature enabled/disabled*/

#define AVRC_PF_EXIT_BIT_NO             13      /**<bit for exit*/
#define AVRC_PF_EXIT_MASK               0x20    /**<mask for exit*/
#define AVRC_PF_EXIT_OFF                1       /**<value when exit is off */
#define AVRC_PF_EXIT_SUPPORTED(x)       ((x)[AVRC_PF_EXIT_OFF] & AVRC_PF_EXIT_MASK)/**<check for exit feature enabled/disabled*/

#define AVRC_PF_0_BIT_NO                14      /**<bit for 0*/
#define AVRC_PF_0_MASK                  0x40    /**<mask for 0*/
#define AVRC_PF_0_OFF                   1       /**<value when 0th feature is off*/
#define AVRC_PF_0_SUPPORTED(x)          ((x)[AVRC_PF_0_OFF] & AVRC_PF_0_MASK)/**<check for 0th  feature enabled/disabled*/

#define AVRC_PF_1_BIT_NO                15      /**<bit for 1*/
#define AVRC_PF_1_MASK                  0x80    /**<mask for 1*/
#define AVRC_PF_1_OFF                   1       /**<value when 1st  feature is off*/
#define AVRC_PF_1_SUPPORTED(x)          ((x)[AVRC_PF_1_OFF] & AVRC_PF_1_MASK)/**<check for 1st  feature enabled/disabled*/

#define AVRC_PF_2_BIT_NO                16      /**<bit for 2*/
#define AVRC_PF_2_MASK                  0x01    /**<mask for 2 */
#define AVRC_PF_2_OFF                   2       /**<value when 2nd feature is off*/
#define AVRC_PF_2_SUPPORTED(x)          ((x)[AVRC_PF_2_OFF] & AVRC_PF_2_MASK)/**<check for 2nd feature enabled/disabled*/

#define AVRC_PF_3_BIT_NO                17      /**<bit for 3*/
#define AVRC_PF_3_MASK                  0x02    /**<mask for 3*/
#define AVRC_PF_3_OFF                   2       /**<value when 3rd feature is off*/
#define AVRC_PF_3_SUPPORTED(x)          ((x)[AVRC_PF_3_OFF] & AVRC_PF_3_MASK) /**<check for 3rd feature enabled/disabled*/

