Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack/wiced_include/wiced_bt_avrc_defs.h
#define AVRC_PF_4_BIT_NO                18      /**<bit for 4*/
#define AVRC_PF_4_MASK                  0x04    /**<mask for 4*/
#define AVRC_PF_4_OFF                   2       /**<value when 4th feature is OFF*/
#define AVRC_PF_4_SUPPORTED(x)          ((x)[AVRC_PF_4_OFF] & AVRC_PF_4_MASK)/**<check for 4th feature enabled/disabled*/

#define AVRC_PF_5_BIT_NO                19      /**<bit for 5*/
#define AVRC_PF_5_MASK                  0x08    /**<mask for 5*/
#define AVRC_PF_5_OFF                   2       /**<value when 5th feature is off*/
#define AVRC_PF_5_SUPPORTED(x)          ((x)[AVRC_PF_5_OFF] & AVRC_PF_5_MASK)/**<check for 5th feature enabled/disabled*/

#define AVRC_PF_6_BIT_NO                20      /**<bit for 6*/
#define AVRC_PF_6_MASK                  0x10    /**<mask for 6*/
#define AVRC_PF_6_OFF                   2       /**<value when 6th feature is off*/
#define AVRC_PF_6_SUPPORTED(x)          ((x)[AVRC_PF_6_OFF] & AVRC_PF_6_MASK)/**<check for 6th feature enabled/disabled*/

#define AVRC_PF_7_BIT_NO                21      /**<bit for 7*/
#define AVRC_PF_7_MASK                  0x20    /**<mask for 7*/
#define AVRC_PF_7_OFF                   2       /**<7th feature off value*/
#define AVRC_PF_7_SUPPORTED(x)          ((x)[AVRC_PF_7_OFF] & AVRC_PF_7_MASK)/**<check for 7th feature enabled/disabled*/

#define AVRC_PF_8_BIT_NO                22      /**<bit for 8*/
#define AVRC_PF_8_MASK                  0x40    /**<mask for 8*/
#define AVRC_PF_8_OFF                   2       /**<8th feature off value*/
#define AVRC_PF_8_SUPPORTED(x)          ((x)[AVRC_PF_8_OFF] & AVRC_PF_8_MASK)/**<check for 8th feature enabled/disabled*/

#define AVRC_PF_9_BIT_NO                23      /**<bit for 9*/
#define AVRC_PF_9_MASK                  0x80    /**<mask for 9*/
#define AVRC_PF_9_OFF                   2       /**<9th feature off value*/
#define AVRC_PF_9_SUPPORTED(x)          ((x)[AVRC_PF_9_OFF] & AVRC_PF_9_MASK)/**<check for 9th feature enabled/disabled*/

#define AVRC_PF_DOT_BIT_NO              24      /**<bit for DOT*/
#define AVRC_PF_DOT_MASK                0x01    /**<mask for DOT*/
#define AVRC_PF_DOT_OFF                 3       /**<DOT feature off value*/
#define AVRC_PF_DOT_SUPPORTED(x)        ((x)[AVRC_PF_DOT_OFF] & AVRC_PF_DOT_MASK)/**<check for DOT feature enabled/disabled*/

#define AVRC_PF_ENTER_BIT_NO            25      /**<bit for enter*/
#define AVRC_PF_ENTER_MASK              0x02    /**<mask for enter*/
#define AVRC_PF_ENTER_OFF               3       /**<enter feature off value*/
#define AVRC_PF_ENTER_SUPPORTED(x)      ((x)[AVRC_PF_ENTER_OFF] & AVRC_PF_ENTER_MASK)/**<check for enter feature enabled/disabled*/

#define AVRC_PF_CLEAR_BIT_NO            26      /**<bit for clear*/
#define AVRC_PF_CLEAR_MASK              0x04    /**<mask for clear*/
#define AVRC_PF_CLEAR_OFF               3       /**<clear feature off value*/
#define AVRC_PF_CLEAR_SUPPORTED(x)      ((x)[AVRC_PF_CLEAR_OFF] & AVRC_PF_CLEAR_MASK)/**<check for clear feature enabled/disabled*/

#define AVRC_PF_CHNL_UP_BIT_NO          27      /**<bit for channel up*/
#define AVRC_PF_CHNL_UP_MASK            0x08    /**<mask for channel up*/
#define AVRC_PF_CHNL_UP_OFF             3       /**<channel up feature off value*/
#define AVRC_PF_CHNL_UP_SUPPORTED(x)    ((x)[AVRC_PF_CHNL_UP_OFF] & AVRC_PF_CHNL_UP_MASK)/**<check for channel up feature enabled/disabled*/

#define AVRC_PF_CHNL_DOWN_BIT_NO        28      /**<bit for channel down*/
#define AVRC_PF_CHNL_DOWN_MASK          0x10    /**<mask for channel down*/
#define AVRC_PF_CHNL_DOWN_OFF           3       /**<channel down feature off value*/
#define AVRC_PF_CHNL_DOWN_SUPPORTED(x)  ((x)[AVRC_PF_CHNL_DOWN_OFF] & AVRC_PF_CHNL_DOWN_MASK)/**<check for channel down feature enabled/disabled*/

#define AVRC_PF_PREV_CHNL_BIT_NO        29      /**<bit for previous channel*/
#define AVRC_PF_PREV_CHNL_MASK          0x20    /**<mask for previous channel*/
#define AVRC_PF_PREV_CHNL_OFF           3       /**<previous channel feature off value*/
#define AVRC_PF_PREV_CHNL_SUPPORTED(x)  ((x)[AVRC_PF_PREV_CHNL_OFF] & AVRC_PF_PREV_CHNL_MASK)/**<check for previous channel feature enabled/disabled*/

#define AVRC_PF_SOUND_SEL_BIT_NO        30      /**<bit for sound selection*/
#define AVRC_PF_SOUND_SEL_MASK          0x40    /**<mask for sound selection*/
#define AVRC_PF_SOUND_SEL_OFF           3       /**<sound selection feature off value*/
#define AVRC_PF_SOUND_SEL_SUPPORTED(x)  ((x)[AVRC_PF_SOUND_SEL_OFF] & AVRC_PF_SOUND_SEL_MASK)/**<check for sound selection feature enabled/disabled*/

#define AVRC_PF_INPUT_SEL_BIT_NO        31      /**<bit for input selection*/
#define AVRC_PF_INPUT_SEL_MASK          0x80    /**<mask for input selection*/
#define AVRC_PF_INPUT_SEL_OFF           3       /**<input selection feature off value*/
#define AVRC_PF_INPUT_SEL_SUPPORTED(x)  ((x)[AVRC_PF_INPUT_SEL_OFF] & AVRC_PF_INPUT_SEL_MASK)/**<check for input selection feature enabled/disabled*/

#define AVRC_PF_DISP_INFO_BIT_NO        32      /**<bit for display info */
#define AVRC_PF_DISP_INFO_MASK          0x01    /**<mask for display info*/
#define AVRC_PF_DISP_INFO_OFF           4       /**<display info feature off value*/
#define AVRC_PF_DISP_INFO_SUPPORTED(x)  ((x)[AVRC_PF_DISP_INFO_OFF] & AVRC_PF_DISP_INFO_MASK)/**<check for display info feature enabled/disabled*/

#define AVRC_PF_HELP_BIT_NO             33      /**<bit for help*/
#define AVRC_PF_HELP_MASK               0x02    /**<mask for help*/
#define AVRC_PF_HELP_OFF                4       /**<help feature off value*/
#define AVRC_PF_HELP_SUPPORTED(x)       ((x)[AVRC_PF_HELP_OFF] & AVRC_PF_HELP_MASK)/**<check for help feature enabled/disabled*/

#define AVRC_PF_PAGE_UP_BIT_NO          34      /**<bit for page up*/
#define AVRC_PF_PAGE_UP_MASK            0x04    /**<mask for page up*/
#define AVRC_PF_PAGE_UP_OFF             4       /**<page up feature off value*/
#define AVRC_PF_PAGE_UP_SUPPORTED(x)    ((x)[AVRC_PF_PAGE_UP_OFF] & AVRC_PF_PAGE_UP_MASK)/**<check for page up feature enabled/disabled*/

#define AVRC_PF_PAGE_DOWN_BIT_NO        35      /**<bit for page down*/
#define AVRC_PF_PAGE_DOWN_MASK          0x08    /**<mask for page down*/
#define AVRC_PF_PAGE_DOWN_OFF           4       /**<page down feature off value*/
#define AVRC_PF_PAGE_DOWN_SUPPORTED(x)  ((x)[AVRC_PF_PAGE_DOWN_OFF] & AVRC_PF_PAGE_DOWN_MASK)/**<check for page down feature enabled/disabled*/

