Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack/wiced_include/wiced_bt_avrc_defs.h
#define AVRC_PF_POWER_BIT_NO            36      /**< bit for power*/
#define AVRC_PF_POWER_MASK              0x10    /**<mask for power*/
#define AVRC_PF_POWER_OFF               4       /**<power feature off value*/
#define AVRC_PF_POWER_SUPPORTED(x)      ((x)[AVRC_PF_POWER_OFF] & AVRC_PF_POWER_MASK)/**<check for power feature enabled/disabled*/

#define AVRC_PF_VOL_UP_BIT_NO           37      /**<bit for volume up*/
#define AVRC_PF_VOL_UP_MASK             0x20    /**<mask for volume up*/
#define AVRC_PF_VOL_UP_OFF              4       /**<volume up feature off value*/
#define AVRC_PF_VOL_UP_SUPPORTED(x)     ((x)[AVRC_PF_VOL_UP_OFF] & AVRC_PF_VOL_UP_MASK)/**<check for volume up feature enabled/disabled*/

#define AVRC_PF_VOL_DOWN_BIT_NO         38      /**<bit for volume down*/
#define AVRC_PF_VOL_DOWN_MASK           0x40    /**<mask for volume down*/
#define AVRC_PF_VOL_DOWN_OFF            4       /**<volume down feature off value*/
#define AVRC_PF_VOL_DOWN_SUPPORTED(x)   ((x)[AVRC_PF_VOL_DOWN_OFF] & AVRC_PF_VOL_DOWN_MASK)/**<check for volume down feature enabled/disabled*/

#define AVRC_PF_MUTE_BIT_NO             39      /**<bit for mute*/
#define AVRC_PF_MUTE_MASK               0x80    /**<mask for mute*/
#define AVRC_PF_MUTE_OFF                4       /**<mute feature off value*/
#define AVRC_PF_MUTE_SUPPORTED(x)       ((x)[AVRC_PF_MUTE_OFF] & AVRC_PF_MUTE_MASK)/**<check for mute feature enabled/disabled*/

#define AVRC_PF_PLAY_BIT_NO             40      /**<bit for play*/
#define AVRC_PF_PLAY_MASK               0x01    /**<mask for play*/
#define AVRC_PF_PLAY_OFF                5       /**<play feature off value*/
#define AVRC_PF_PLAY_SUPPORTED(x)       ((x)[AVRC_PF_PLAY_OFF] & AVRC_PF_PLAY_MASK)/**<check for play feature enabled/disabled*/

#define AVRC_PF_STOP_BIT_NO             41      /**<bit for stop*/
#define AVRC_PF_STOP_MASK               0x02    /**<mask for stop*/
#define AVRC_PF_STOP_OFF                5       /**<stop feature off value*/
#define AVRC_PF_STOP_SUPPORTED(x)       ((x)[AVRC_PF_STOP_OFF] & AVRC_PF_STOP_MASK)/**<check for stop feature enabled/disabled*/

#define AVRC_PF_PAUSE_BIT_NO            42      /**<bit for pause*/
#define AVRC_PF_PAUSE_MASK              0x04    /**<mask for pause*/
#define AVRC_PF_PAUSE_OFF               5       /**<pause feature off value*/
#define AVRC_PF_PAUSE_SUPPORTED(x)      ((x)[AVRC_PF_PAUSE_OFF] & AVRC_PF_PAUSE_MASK)/**<check for pause feature enabled/disabled*/

#define AVRC_PF_RECORD_BIT_NO           43      /**<bit for record*/
#define AVRC_PF_RECORD_MASK             0x08    /**<mask for record*/
#define AVRC_PF_RECORD_OFF              5       /**<record feature off value*/
#define AVRC_PF_RECORD_SUPPORTED(x)     ((x)[AVRC_PF_RECORD_OFF] & AVRC_PF_RECORD_MASK)/**<check for record feature enabled/disabled*/

#define AVRC_PF_REWIND_BIT_NO           44      /**<bit for rewind*/
#define AVRC_PF_REWIND_MASK             0x10    /**<mask for rewind*/
#define AVRC_PF_REWIND_OFF              5       /**<rewind feature off value*/
#define AVRC_PF_REWIND_SUPPORTED(x)     ((x)[AVRC_PF_REWIND_OFF] & AVRC_PF_REWIND_MASK)/**<check for rewind feature enabled/disabled*/

#define AVRC_PF_FAST_FWD_BIT_NO         45      /**<bit for fast forward*/
#define AVRC_PF_FAST_FWD_MASK           0x20    /**<mask for fast forward*/
#define AVRC_PF_FAST_FWD_OFF            5       /**<fast forward feature off value*/
#define AVRC_PF_FAST_FWD_SUPPORTED(x)   ((x)[AVRC_PF_FAST_FWD_OFF] & AVRC_PF_FAST_FWD_MASK)/**<check for fast forward feature enabled/disabled*/

#define AVRC_PF_EJECT_BIT_NO            46      /**<bit for eject*/
#define AVRC_PF_EJECT_MASK              0x40    /**<mask for eject*/
#define AVRC_PF_EJECT_OFF               5       /**<eject feature off value*/
#define AVRC_PF_EJECT_SUPPORTED(x)      ((x)[AVRC_PF_EJECT_OFF] & AVRC_PF_EJECT_MASK)/**<check for eject feature enabled/disabled*/

#define AVRC_PF_FORWARD_BIT_NO          47      /**<bit for forward*/
#define AVRC_PF_FORWARD_MASK            0x80    /**<mask for forward*/
#define AVRC_PF_FORWARD_OFF             5       /**<forward feature off value*/
#define AVRC_PF_FORWARD_SUPPORTED(x)    ((x)[AVRC_PF_FORWARD_OFF] & AVRC_PF_FORWARD_MASK)/**<check for forward feature enabled/disabled*/

#define AVRC_PF_BACKWARD_BIT_NO         48      /**<bit for backward*/
#define AVRC_PF_BACKWARD_MASK           0x01    /**<mask for backward*/
#define AVRC_PF_BACKWARD_OFF            6       /**<backward feature off value*/
#define AVRC_PF_BACKWARD_SUPPORTED(x)   ((x)[AVRC_PF_BACKWARD_OFF] & AVRC_PF_BACKWARD_MASK)/**<check for backward feature enabled/disabled*/

#define AVRC_PF_ANGLE_BIT_NO            49      /**<bit for angle*/
#define AVRC_PF_ANGLE_MASK              0x02    /**<mask for angle*/
#define AVRC_PF_ANGLE_OFF               6       /**<angle feature off value*/
#define AVRC_PF_ANGLE_SUPPORTED(x)      ((x)[AVRC_PF_ANGLE_OFF] & AVRC_PF_ANGLE_MASK)/**<check for angle feature enabled/disabled*/

#define AVRC_PF_SUBPICTURE_BIT_NO       50      /**<bit for subpicture*/
#define AVRC_PF_SUBPICTURE_MASK         0x04    /**<mask for subpicture*/
#define AVRC_PF_SUBPICTURE_OFF          6       /**<subpicture feature off value*/
#define AVRC_PF_SUBPICTURE_SUPPORTED(x) ((x)[AVRC_PF_SUBPICTURE_OFF] & AVRC_PF_SUBPICTURE_MASK)/**<check for subpicture feature enabled/disabled*/

#define AVRC_PF_F1_BIT_NO               51      /**<bit for F1*/
#define AVRC_PF_F1_MASK                 0x08    /**<mask for F1*/
#define AVRC_PF_F1_OFF                  6       /**<F1 off value*/
#define AVRC_PF_F1_SUPPORTED(x)         ((x)[AVRC_PF_F1_OFF] & AVRC_PF_F1_MASK)/**<check for F1 feature enabled/disabled*/

#define AVRC_PF_F2_BIT_NO               52      /**<Bit for F2*/
#define AVRC_PF_F2_MASK                 0x10    /**<mask for F2*/
#define AVRC_PF_F2_OFF                  6       /**<F2 feature off value*/
#define AVRC_PF_F2_SUPPORTED(x)         ((x)[AVRC_PF_F2_OFF] & AVRC_PF_F2_MASK)/**<check for F2 feature enabled/disabled*/

#define AVRC_PF_F3_BIT_NO               53      /**<Bit for F3*/
#define AVRC_PF_F3_MASK                 0x20    /**<mask for F3*/
#define AVRC_PF_F3_OFF                  6       /**<F3 off value*/
#define AVRC_PF_F3_SUPPORTED(x)         ((x)[AVRC_PF_F3_OFF] & AVRC_PF_F3_MASK)/**<check for F3 feature enabled/disabled*/

