Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack/wiced_include/wiced_bt_avrc_defs.h
#define AVRC_PF_F4_BIT_NO               54      /**<bit for F4*/
#define AVRC_PF_F4_MASK                 0x40    /**<mask for F4*/
#define AVRC_PF_F4_OFF                  6       /**<F4 off value*/
#define AVRC_PF_F4_SUPPORTED(x)         ((x)[AVRC_PF_F4_OFF] & AVRC_PF_F4_MASK)/**<check for F4 feature enabled/disabled*/

#define AVRC_PF_F5_BIT_NO               55      /**<bit for F5*/
#define AVRC_PF_F5_MASK                 0x80    /**<mask for F5*/
#define AVRC_PF_F5_OFF                  6       /**<F5 off value*/
#define AVRC_PF_F5_SUPPORTED(x)         ((x)[AVRC_PF_F5_OFF] & AVRC_PF_F5_MASK)/**<check for F5 feature enabled/disabled*/

/* Vendor unique. This PASSTHROUGH command is supported. */
#define AVRC_PF_VENDOR_BIT_NO           56      /**<bit for vendor*/
#define AVRC_PF_VENDOR_MASK             0x01    /**<mask for vendor*/
#define AVRC_PF_VENDOR_OFF              7       /**<vendor feature off value*/
#define AVRC_PF_VENDOR_SUPPORTED(x)     ((x)[AVRC_PF_VENDOR_OFF] & AVRC_PF_VENDOR_MASK)/**<check for vendor feature enabled/disabled*/

/* Basic Group Navigation.  This overrules the SDP entry as it is set per player.7 */
#define AVRC_PF_GROUP_NAVI_BIT_NO       57      /**<bit for Group navigation*/
#define AVRC_PF_GROUP_NAVI_MASK         0x02    /**<mask for Group Navigation*/
#define AVRC_PF_GROUP_NAVI_OFF          7       /**<Group Navigation feature off value*/
#define AVRC_PF_GROUP_NAVI_SUPPORTED(x) ((x)[AVRC_PF_GROUP_NAVI_OFF] & AVRC_PF_GROUP_NAVI_MASK)/**<check for Group navigation feature enabled/disabled*/

/* Advanced Control Player.  This bit is set if the player supports at least AVRCP 1.4. */
#define AVRC_PF_ADV_CTRL_BIT_NO         58      /**<Bit for advanced control support*/
#define AVRC_PF_ADV_CTRL_MASK           0x04    /**<mask for advanced control*/
#define AVRC_PF_ADV_CTRL_OFF            7       /**<advanced control feature off value*/
#define AVRC_PF_ADV_CTRL_SUPPORTED(x)   ((x)[AVRC_PF_ADV_CTRL_OFF] & AVRC_PF_ADV_CTRL_MASK)/**<check for advanced control feature enabled/disabled*/

/* Browsing.  This bit is set if the player supports browsing. */
#define AVRC_PF_BROWSE_BIT_NO           59      /**<bit for browsing*/
#define AVRC_PF_BROWSE_MASK             0x08    /**<mask for browsing*/
#define AVRC_PF_BROWSE_OFF              7       /**<browsing feature off value*/
#define AVRC_PF_BROWSE_SUPPORTED(x)     ((x)[AVRC_PF_BROWSE_OFF] & AVRC_PF_BROWSE_MASK)/**<check for browsing feature enabled/disabled*/

/* Searching. This bit is set if the player supports searching. */
#define AVRC_PF_SEARCH_BIT_NO           60      /**<bit for search*/
#define AVRC_PF_SEARCH_MASK             0x10    /**<mask for search*/
#define AVRC_PF_SEARCH_OFF              7       /**<search off value*/
#define AVRC_PF_SEARCH_SUPPORTED(x)     ((x)[AVRC_PF_SEARCH_OFF] & AVRC_PF_SEARCH_MASK)/**<check for search feature enabled/disabled*/

/* AddToNowPlaying.  This bit is set if the player supports the AddToNowPlaying command. */
#define AVRC_PF_ADD2NOWPLAY_BIT_NO      61      /**<bit add to nowplaying*/
#define AVRC_PF_ADD2NOWPLAY_MASK        0x20    /**<mask for add to nowplaying*/
#define AVRC_PF_ADD2NOWPLAY_OFF         7       /**<add to nowplaying off value*/
#define AVRC_PF_ADD2NOWPLAY_SUPPORTED(x) ((x)[AVRC_PF_ADD2NOWPLAY_OFF] & AVRC_PF_ADD2NOWPLAY_MASK)/**<check for add to nowplaying feature enabled/disabled*/

/* UIDs unique in player browse tree.  This bit is set if the player is able to maintain unique UIDs across the player browse tree. */
#define AVRC_PF_UID_UNIQUE_BIT_NO       62      /**<bit for unique uid*/
#define AVRC_PF_UID_UNIQUE_MASK         0x40    /**<mask for unique uid*/
#define AVRC_PF_UID_UNIQUE_OFF          7       /**<unique uid off value*/
#define AVRC_PF_UID_UNIQUE_SUPPORTED(x) ((x)[AVRC_PF_UID_UNIQUE_OFF] & AVRC_PF_UID_UNIQUE_MASK)/**<check for unique uid feature enabled/disabled*/

/* OnlyBrowsableWhenAddressed.  This bit is set if the player is only able to be browsed when it is set as the Addressed Player. */
#define AVRC_PF_BR_WH_ADDR_BIT_NO       63      /**<bit for OnlyBrowsableWhenAddressed*/
#define AVRC_PF_BR_WH_ADDR_MASK         0x80    /**<mask for OnlyBrowsableWhenAddressed*/
#define AVRC_PF_BR_WH_ADDR_OFF          7       /**<OnlyBrowsableWhenAddressed off value*/
#define AVRC_PF_BR_WH_ADDR_SUPPORTED(x) ((x)[AVRC_PF_BR_WH_ADDR_OFF] & AVRC_PF_BR_WH_ADDR_MASK)/**<check for OnlyBrowsableWhenAddressed feature enabled/disabled*/

/* OnlySearchableWhenAddressed.  This bit is set if the player is only able to be searched when it is set as the Addressed player. */
#define AVRC_PF_SEARCH_WH_ADDR_BIT_NO   64      /**<bit for OnlySearchableWhenAddressed*/
#define AVRC_PF_SEARCH_WH_ADDR_MASK     0x01    /**<mask for OnlySearchableWhenAddressed*/
#define AVRC_PF_SEARCH_WH_ADDR_OFF      8       /**<OnlySearchableWhenAddressed off value*/
#define AVRC_PF_SEARCH_WH_ADDR_SUPPORTED(x) ((x)[AVRC_PF_SEARCH_WH_ADDR_OFF] & AVRC_PF_SEARCH_WH_ADDR_MASK)/**<check for OnlySearchableWhenAddressed feature enabled/disabled*/

/* NowPlaying.  This bit is set if the player supports the NowPlaying folder.  Note that for all players that support browsing this bit shall be set */
#define AVRC_PF_NOW_PLAY_BIT_NO         65      /**<bit for nowplaying*/
#define AVRC_PF_NOW_PLAY_MASK           0x02    /**<mask for nowplaying*/
#define AVRC_PF_NOW_PLAY_OFF            8       /**<nowplaying off value*/
#define AVRC_PF_NOW_PLAY_SUPPORTED(x)   ((x)[AVRC_PF_NOW_PLAY_OFF] & AVRC_PF_NOW_PLAY_MASK)/**<check for nowplaying feature enabled/disabled*/

/* UIDPersistency.  This bit is set if the Player is able to persist UID values between AVRCP Browse Reconnect */
#define AVRC_PF_UID_PERSIST_BIT_NO      66      /**<bit for UID Persistency*/
#define AVRC_PF_UID_PERSIST_MASK        0x04    /**<mask for UID Persistency*/
#define AVRC_PF_UID_PERSIST_OFF         8       /**<UID Persistency off value*/
#define AVRC_PF_UID_PERSIST_SUPPORTED(x) ((x)[AVRC_PF_UID_PERSIST_OFF] & AVRC_PF_UID_PERSIST_MASK)/**<check for UID Persistency feature enabled/disabled*/

/* NumberOfItems. This bit is set if the player supports the GetTotalNumberOfItems browsing command. */
#define AVRC_PF_GET_NUM_OF_ITEMS_BIT_NO    67       /**<bit for NumberOfItems*/
#define AVRC_PF_GET_NUM_OF_ITEMS_MASK      0x08     /**<mask for NumberOfItems*/
#define AVRC_PF_GET_NUM_OF_ITEMS_OFF       8        /**<NumberOfItems off value*/
#define AVRC_PF_GET_NUM_OF_ITEMS_SUPPORTED(x) ((x)[AVRC_PF_GET_NUM_OF_ITEMS_OFF] & AVRC_PF_GET_NUM_OF_ITEMS_MASK)/**<check for NumberOfItems feature enabled/disabled*/

/*****************************************************************************
**  data type definitions
*****************************************************************************/
#define AVRC_1_6_INCLUDED           TRUE /**< TRUE to support the AVRCP 1.6 (GetTotalNumOfItems). */

#define AVRC_METADATA_INCLUDED      TRUE    /**<Metadata feature included status*/
#define AVRC_ADV_CTRL_INCLUDED      TRUE    /**<AVRC advanced control included status*/
/* TRUE to support the browsing channel. */
#define AVRC_BROWSE_INCLUDED    TRUE    /**<TRUE to support if AVCT browse enable */

/** AV/C message header */
typedef struct
{
    uint8_t   ctype;                        /**< Message type (see @ref wiced_bt_avrc_ctype_e) */
    uint8_t   subunit_type;                 /**< Subunit type (see @ref AVRC_SUBUNIT_TYPE "AVRC subunit types") */
    uint8_t   subunit_id;                   /**< Subunit ID (typically ignored for AVRCP; except for VENDOR DEPENDENT messages (Value range: 0-7) */
    uint8_t   opcode;                       /**< Opcode (passthrough, vendor, etc) */
} wiced_bt_avrc_hdr_t;


