Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack/wiced_include/wiced_bt_avrc_defs.h
/* Command/Response indicator. */
#define AVCT_CMD                    0       /**< Command message */
#define AVCT_RSP                    2       /**< Response message */
#define AVCT_REJ                    3       /**< Message rejected */

#define AVRC_CMD            AVCT_CMD        /**< Command message */
#define AVRC_RSP            AVCT_RSP        /**< Response message */

/** AVRC Transmit buffer - used to build and transmit application payload */
typedef struct
{
    uint16_t      buffer_size;            /**< The size of the payload buffer          */
    uint16_t      len_used;               /**< The amount of data in the buffer        */
    uint8_t       is_cmd;                 /**< TRUE if a command, FALSE if a response  */
    uint8_t       meta_pdu_id;            /**< The MetaData (vendor dependant) PDU ID  */
    uint8_t       payload[1];             /**< Actual size is specified in buffer_size */
} wiced_bt_avrc_xmit_buf_t;


#define WICED_AVRC_XMIT_BUF_OVERHEAD (sizeof (uint16_t) + sizeof (uint16_t) + sizeof (uint8_t) + sizeof (uint8_t)) /**< The amount of overhead in wiced_bt_avrc_xmit_buf_t before the payload */

/* macros */
#define AVRC_IS_VALID_CAP_ID(a)           (((a == AVRC_CAP_COMPANY_ID) || (a == AVRC_CAP_EVENTS_SUPPORTED)) ? TRUE : FALSE) /**<Check for valid capability ids*/

/** Macro to check for valid AVRC event*/
#if (AVRC_ADV_CTRL_INCLUDED == TRUE)
#define AVRC_IS_VALID_EVENT_ID(a)           (((a >= AVRC_EVT_PLAY_STATUS_CHANGE) && \
                                              (a <= AVRC_EVT_VOLUME_CHANGE)) ? TRUE : FALSE)
#else /* AVRCP 1.3 */
#define AVRC_IS_VALID_EVENT_ID(a)           (((a >= AVRC_EVT_PLAY_STATUS_CHANGE) && \
                                              (a <= AVRC_EVT_APP_SETTING_CHANGE)) ? TRUE : FALSE)
#endif

#define AVRC_IS_VALID_ATTRIBUTE(a)          (((a <= AVRC_PLAYER_SETTING_SCAN) || \
                                               (a >= AVRC_PLAYER_SETTING_LOW_MENU_EXT)) ? WICED_TRUE : WICED_FALSE)/**<Check for valid AVRC attribute*/


#define AVRC_IS_VALID_MEDIA_ATTRIBUTE(a)    ((a >= AVRC_MEDIA_ATTR_ID_TITLE) && \
                                             (a <= AVRC_MEDIA_ATTR_ID_PLAYING_TIME) ? WICED_TRUE : WICED_FALSE) /**<Check for valid metadata attribute*/

#define AVRC_IS_VALID_BATTERY_STATUS(a)    ((a <= AVRC_BATTERY_STATUS_FULL_CHARGE) ? WICED_TRUE : WICED_FALSE)/**<Check for valid battery status*/

#define AVRC_IS_VALID_SYSTEM_STATUS(a)    ((a <= AVRC_SYSTEMSTATE_PWR_UNPLUGGED) ? WICED_TRUE : WICED_FALSE)/**<Check for valid system status*/

#define AVRC_IS_VALID_GROUP(a)    ((a <= AVRC_PDU_PREV_GROUP) ? WICED_TRUE : WICED_FALSE)/**<Check for valid group*/

/* Company ID is 24-bit integer We can not use the macros in bt_types.h */
/** Macro to convert 24bit company id to 32bit stream */
#define AVRC_CO_ID_TO_BE_STREAM(p, u32) {*(p)++ = (uint8_t)((u32) >> 16); *(p)++ = (uint8_t)((u32) >> 8); *(p)++ = (uint8_t)(u32); }
/** Macro to convert 32bit stream to company id */
#define AVRC_BE_STREAM_TO_CO_ID(u32, p) {u32 = (((uint32_t)(*((p) + 2))) + (((uint32_t)(*((p) + 1))) << 8) + (((uint32_t)(*(p))) << 16)); (p) += 3;}

/*****************************************************************************
**  data type definitions
*****************************************************************************/
#define AVRC_MAX_APP_ATTR_SIZE      16  /**<max application attribute size*/
#define AVRC_MAX_CHARSET_SIZE       16  /**<max character set size*/
#define AVRC_MAX_ELEM_ATTR_SIZE     8   /**<max element attribute size*/

#define AVRC_DEFAULT_METADATA_SCRATCH_SZ     1024   /**<Default metadata scratch size*/
#define AVRC_DEFAULT_METADATA_CMD_SIZE       512    /**<default metadata command size*/
#define AVRC_DEFAULT_METADATA_RSP_SIZE       512    /**<default metadata response size*/
#define AVRC_MAX_METADATA_RCV_MSG_SIZE       512    /**<Max metadata received message size*/
#define AVRC_MAX_AVCT_RCV_PKT_SIZE           512    /**<Max AVCT received packet size*/


/*****************************************************************************
**  Metadata transfer Building/Parsing definitions
*****************************************************************************/
#ifndef AVRC_CAP_MAX_NUM_COMP_ID
#define AVRC_CAP_MAX_NUM_COMP_ID    4 /**<maximum supported number of company ids*/
#endif

#ifndef AVRC_CAP_MAX_NUM_EVT_ID
#define AVRC_CAP_MAX_NUM_EVT_ID     16  /**<maximum supported number of event ids*/
#endif

/** AVRCP capabilities param used in building getCapabilities packet*/
typedef union
{
    uint32_t  company_id[AVRC_CAP_MAX_NUM_COMP_ID];     /**< company id*/
    uint8_t   event_id[AVRC_CAP_MAX_NUM_EVT_ID];        /**< event id*/
} wiced_bt_avrc_caps_param_t;

/**AVRCP Application settings*/
typedef struct
{
    uint8_t   attr_id;  /**< Attribute id */
    uint8_t   attr_val; /**< Attribute value */
} wiced_bt_avrc_app_setting_t;

typedef uint8_t wiced_bt_avrc_feature_mask_t[AVRC_FEATURE_MASK_SIZE];   /**< AVRCP feature mask*/

/** PlayItem & AddToNowPlaying */
typedef struct
{
    uint8_t                 scope;		/**< scope */
    wiced_bt_avrc_uid_t     uid;		/**< Item's uid */
    uint16_t                uid_counter;	/**< uid counter */
} wiced_bt_avrc_metadata_play_cmd_t;


/** notification event parameter for AddressedPlayer change */
typedef struct
{
    uint16_t                player_id;      /**< player id*/
    uint16_t                uid_counter;    /**< uid counter*/
} wiced_bt_avrc_addr_player_param_t;

#ifndef AVRC_MAX_APP_SETTINGS
#define AVRC_MAX_APP_SETTINGS    8  /**<Maximum supported app settings*/
#endif


/**AVRCP name used in building metadata name and folder name  in browsing*/
typedef struct {
    uint16_t              str_len;	/**< metadata/folder string length */
    uint8_t               *p_str;	/**< metadata/folder  string content */
} wiced_bt_avrc_name_t;

/**AVRCP full name used in building and receiving metadata packet*/
typedef struct {
    uint16_t              charset_id;	/**< character set id*/
    wiced_bt_avrc_name_t  name;         /**< attribute name */
} wiced_bt_avrc_full_name_t;

/**Unit info command message */
typedef struct {
    uint8_t unit_info[5];		/**< UNIT INFO message*/
}wiced_bt_avrc_unit_info_cmd_t;

/**Unit info response message */

