Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack/wiced_include/wiced_bt_avrc_defs.h
typedef struct {
    uint8_t   byte;         /**< one byte value */
    uint8_t   unit;         /**< This value is vendor dependent and typically zero */
    uint8_t   unit_type;    /**< Unit type (see @ref AVRC_SUBUNIT_TYPE "AVRC subunit types") */
    uint32_t  company_id;   /**< Company identifier */
}wiced_bt_avrc_unit_info_rsp_t;

/**Subunit info command */

typedef struct {
    uint8_t page;           /**< Specifies which part of the subunit type table is returned. For AVRCP it is typically zero. Value range is 0-7 */
    uint8_t extension_code; /**< subunit info exetension code */
    uint8_t data[4];        /**< sub unit info command value */
}wiced_bt_avrc_sub_unit_info_cmd_t;

/**Subunit info response */
typedef struct {
    uint8_t   extension_code;   /**< subunit info exetension code */
    uint8_t   page;             /**< Specifies which part of the subunit type table is returned. For AVRCP it is typically zero. Value range is 0-7 */
    uint8_t   max_subunit_id;   /**< max subunit id */
    uint32_t  subunit_type;     /**< subunit type see @ref AVRC_SUBUNIT_TYPE "AVRC subunit types")  */
    uint8_t   octets[3];        /**< subunit value */
}wiced_bt_avrc_sub_unit_info_rsp_t;

/**Passthrough response header */
typedef struct {
    uint8_t operation_id;           /**< Operation ID */
    uint8_t state;                  /**< Keypress state */
    uint8_t operation_field_len;    /**< data length  */
}wiced_bt_avrc_pass_thru_hdr_t;

/**Passthrough group navigation command */
typedef struct {
    uint32_t company_id;            /**< company identifier */
    uint16_t vendor_operation_id;   /**<operation id */
}wiced_bt_avrc_pass_thru_group_nav_cmd_t;

/**Passthrough command */

typedef union {
    wiced_bt_avrc_pass_thru_hdr_t hdr;                  /**< passthrough command header */
    wiced_bt_avrc_pass_thru_group_nav_cmd_t group_nav;  /**< group navigation command*/
}wiced_bt_avrc_pass_thru_cmd_t;

/** GetCapability */
typedef struct
{
    uint8_t     capability_id;  /**< Capability id */
} wiced_bt_avrc_metadata_get_caps_cmd_t;

/** ListPlayerAppValues */
typedef struct
{
    uint8_t                 attr_id;    /**< attribute id */
} wiced_bt_avrc_metadata_list_app_settings_values_cmd_t;

/** GetCurAppValue */
typedef struct
{
    uint8_t                 num_attr;   /**< number of attributes */
    uint8_t                 *p_vals;    /**< list of App attributes to retrieve*/
} wiced_bt_avrc_metadata_get_cur_app_value_cmd_t;

/** SetAppValue */
typedef struct
{
    uint8_t                     num_val;    /**< number of attributes values */
    wiced_bt_avrc_app_setting_t *p_vals;    /**< list of App attributes values to set*/
} wiced_bt_avrc_metadata_set_app_value_cmd_t;

/** GetAppAttrTxt */
typedef struct
{
    uint8_t                 num_attr;   /**< number of attributes */
    uint8_t                 *p_attrs;   /**< list of App attributes text to retrieve*/
} wiced_bt_avrc_metadata_get_app_attr_txt_cmd_t;

/** GetAppValueTxt */
typedef struct
{
    uint8_t                 attr_id;    /**< attribute id*/
    uint8_t                 num_val;    /**< number of attributes values */
    uint8_t                 *p_vals;    /**< list of App attributes values to retrieve*/
} wiced_bt_avrc_metadata_get_app_val_txt_cmd_t;

/** InformCharset */
typedef struct
{
    uint8_t                 num_id;         /**< number of charset ids */
    uint16_t                *p_charsets;    /**< list of supported character set ids*/
} wiced_bt_avrc_metadata_inform_charset_cmd_t;

/** InformBatteryStatus */
typedef struct
{
    uint8_t                 battery_status; /**< Battery status*/
} wiced_bt_avrc_metadata_battery_status_cmd_t;

/** GetElemAttrs */
typedef struct
{
    uint32_t                identifier[2];                  /**< identifier to identify an element on TG */
    uint8_t                 num_attr;	                    /**< number of attributes*/
    uint32_t                attrs[AVRC_MAX_ELEM_ATTR_SIZE];	 /**< list of attributes*/
} wiced_bt_avrc_metadata_get_elem_attrs_cmd_t;

/** RegNotify */
typedef struct
{
    uint8_t                 event_id;			/**< event id*/
    uint32_t                playback_interval; /**< playback interval */
} wiced_bt_avrc_metadata_reg_notif_cmd_t;

/** Continue PDUs */
typedef struct
{
    uint8_t                  pdu_id;    /**< pdu id */
} wiced_bt_avrc_metadata_continuation_pdu_cmd_t;

/** GetFolderItems */
typedef struct
{
    uint8_t                 scope;          /**< scope */
    uint32_t                start_item;     /**< statrt item uid*/
    uint32_t                end_item;       /**< end item uid */
    uint8_t                 attr_count;     /**< attributes count */
    uint32_t                *p_attr_list;   /**< attribute list to get*/
} wiced_bt_avrc_browse_get_items_cmd_t;

/** ChangePath */
typedef struct
{
	 uint16_t				 uid_counter;	 /**< uid counter */
	 uint8_t				 direction; 	 /**< direction for folder change */
	 wiced_bt_avrc_uid_t	 folder_uid;	 /**< folder uid to switch */

} wiced_bt_avrc_browse_chg_path_cmd_t;

/** GetItemAttrs */
typedef struct
{
    uint8_t                 scope; 			/**< scope */
    wiced_bt_avrc_uid_t     uid;			/**< Item's uid */
    uint16_t                uid_counter; 	/**< uid counter */
    uint8_t                 attr_count;		/**< attributes count */
    uint32_t                *p_attr_list;  	/**< list of attributes to get for the item */
} wiced_bt_avrc_browse_get_item_attrs_cmd_t;

/** Search */
typedef struct
{
    wiced_bt_avrc_full_name_t   string;		/**< string to search for */
} wiced_bt_avrc_browse_search_cmd_t;

/** GetTotalNumOfItems */
typedef struct
{
    uint8_t                 scope;		/**< scope */
} wiced_bt_avrc_browse_get_num_of_items_cmd_t;


/** Continue and Abort */
typedef struct
{
    uint8_t                 target_pdu;		 /**< target pdu to continue/abort to receive */
} wiced_bt_avrc_browse_next_cmd_t;


/** metadata message header */
typedef struct {
    uint32_t company_id;	/**< Company identifier */
    uint8_t pdu;			/**< pdu id */
    uint8_t packet_type;	/**< message type */
    uint16_t param_len;		/**< data length */
}wiced_bt_avrc_metadata_hdr_t;



