Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack/wiced_include/wiced_bt_avrc_defs.h
/** AVRC commands */
typedef struct {
    wiced_bt_avrc_metadata_hdr_t metadata_hdr;  /**< AVRC command header, see @ref wiced_bt_avrc_metadata_hdr_t  */
    union
    {
        wiced_bt_avrc_metadata_get_caps_cmd_t                   get_caps;               /**< GetCapability cmd       */
        wiced_bt_avrc_metadata_list_app_settings_values_cmd_t   list_app_values;        /**< ListPlayerAppValues cmd */
        wiced_bt_avrc_metadata_get_cur_app_value_cmd_t          get_cur_app_val;        /**< GetCurAppValue cmd      */
        wiced_bt_avrc_metadata_set_app_value_cmd_t              set_app_val;            /**< SetAppValue cmd         */
        wiced_bt_avrc_metadata_get_app_attr_txt_cmd_t           get_app_attr_txt;       /**< GetAppAttrTxt cmd       */
        wiced_bt_avrc_metadata_get_app_val_txt_cmd_t            get_app_val_txt;        /**< GetAppValueTxt cmd      */
        wiced_bt_avrc_metadata_inform_charset_cmd_t             inform_charset;         /**< InformCharset cmd       */
        wiced_bt_avrc_metadata_battery_status_cmd_t             inform_battery_status;  /**< InformBatteryStatus cmd */
        wiced_bt_avrc_metadata_get_elem_attrs_cmd_t             get_elem_attrs;         /**< GetElemAttrs cmd        */
        wiced_bt_avrc_metadata_reg_notif_cmd_t                  reg_notif;              /**< RegNotify cmd           */
        wiced_bt_avrc_metadata_continuation_pdu_cmd_t           continuation_pdu;       /**< Continuation PDU cmd    */
        wiced_bt_avrc_metadata_continuation_pdu_cmd_t           abort_pdu;              /**< Continuation PDU cmd    */

        uint16_t                                                 player_id;              /**< SetAddrPlayer cmd       */
        uint8_t                                                  volume;                 /**< SetAbsVolume cmd        */
        wiced_bt_avrc_metadata_play_cmd_t                        play_item;              /**< PlayItem & AddToNowPlaying */
    }u; /**< Metadata command */
}wiced_bt_avrc_metadata_cmd_t;

/** Browse command structure*/
typedef struct {
    uint8_t pdu;	/**< pdu id */
    uint16_t param_len;	/**< data length */
    union{
        wiced_bt_avrc_browse_next_cmd_t                       continu;                /**< Continue             */
        wiced_bt_avrc_browse_next_cmd_t                       abort;                  /**< Abort                */
        uint16_t                                              player_id;              /**< SetBrowsedPlayer     */
        wiced_bt_avrc_browse_get_items_cmd_t                  get_folder_items;       /**< GetFolderItems       */
        wiced_bt_avrc_browse_chg_path_cmd_t                   chg_path;               /**< ChangePath           */
        wiced_bt_avrc_browse_get_item_attrs_cmd_t             get_item_attrs;         /**< GetItemAttrs         */
        wiced_bt_avrc_browse_search_cmd_t                     search;                 /**< Search               */
        wiced_bt_avrc_browse_get_num_of_items_cmd_t           get_num_of_items;       /**< GetTotalNumOfItems   */
    }browse_cmd;/**< Browse command */
}wiced_bt_avrc_browse_cmd_t;


/** GetCapability rsp*/
typedef struct
{
    uint8_t                     capability_id;	/**< Capability id */
    uint8_t                     count;			/**< count */
    wiced_bt_avrc_caps_param_t  param;			/**< param */
} wiced_bt_avrc_metadata_get_caps_rsp_t;

/** ListPlayerAppAttr */
typedef struct
{
    uint8_t                 num_attr;		/**< number of attributes */
    uint8_t                 *p_attrs;		/**< list of attributes in response */
} wiced_bt_avrc_metadata_list_app_attr_rsp_t;

/** ListPlayerAppValues */
typedef struct
{
    uint8_t                 num_val;		/**< number of Application values */
    uint8_t                 *p_vals;		 /**< list of application values in response*/
} wiced_bt_avrc_metadata_list_app_values_rsp_t;

/** PlayerApplicationSetting_text */
typedef struct
{
    uint8_t   attr_id;		/**< attribute id */
    wiced_bt_avrc_full_name_t name;	/**<attribute name */
} wiced_bt_avrc_app_setting_text_t;


/** GetCurAppValue */
typedef struct
{
    uint8_t 	num_val;	/**< number of current Application values */
    uint8_t 	*p_vals;   /**< list of application values in response of type @ref  wiced_bt_avrc_app_setting_t */
} wiced_bt_avrc_metadata_get_cur_app_value_rsp_t;


/** GetAppAttrTxt */
typedef struct
{
    uint8_t                             num_attr;	/**< number of attributes */
    uint16_t                            length;		/**< length of the Application attribute list */
    uint8_t                             *p_val_stream;	 /**< list of application values in response of type @ref  wiced_bt_avrc_app_setting_text_t */

} wiced_bt_avrc_metadata_get_app_attr_txt_rsp_t;

/** Browsing attribute */
typedef struct
{
    uint32_t                        attr_id;        /**< Use AVRC_MEDIA_ATTR_ID_TITLE, AVRC_MEDIA_ATTR_ID_ARTIST, AVRC_MEDIA_ATTR_ID_ALBUM,
                                                        AVRC_MEDIA_ATTR_ID_TRACK_NUM, AVRC_MEDIA_ATTR_ID_NUM_TRACKS,
                                                        AVRC_MEDIA_ATTR_ID_GENRE, AVRC_MEDIA_ATTR_ID_PLAYING_TIME */
    wiced_bt_avrc_full_name_t       name;           /**< The attribute value, value length and character set id. */
} wiced_bt_avrc_attr_entry_t;

/** GetElemAttrs */
typedef struct
{
    uint8_t                     num_attr;	/**< number of attributes */
    uint8_t 					length;		/**< length of the attribute list */
    uint8_t                     *p_attr_stream;   /**< list of application values in response of type @ref  wiced_bt_avrc_attr_entry_t */
} wiced_bt_avrc_get_attrs_t;

typedef wiced_bt_avrc_get_attrs_t wiced_bt_avrc_metadata_get_element_attrs_rsp_t; /**< getelementattribute response type */

/** GetPlayStatus */
typedef struct
{
    uint32_t                song_len;       /**< track length */
    uint32_t                song_pos;       /**< track playback position */
    uint8_t                 play_status;    /**< playback status */

} wiced_bt_avrc_metadata_get_play_status_rsp_t;


/* Define the possible values of Battery Status PDU
*/
#define AVRC_BATTERY_STATUS_NORMAL              0x00
#define AVRC_BATTERY_STATUS_WARNING             0x01
#define AVRC_BATTERY_STATUS_CRITICAL            0x02
#define AVRC_BATTERY_STATUS_EXTERNAL            0x03
#define AVRC_BATTERY_STATUS_FULL_CHARGE         0x04

