Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/btstack/wiced_include/wiced_bt_avrc_defs.h
/* Define the possible values of system status
*/
#define AVRC_SYSTEMSTATE_PWR_ON                 0x00
#define AVRC_SYSTEMSTATE_PWR_OFF                0x01
#define AVRC_SYSTEMSTATE_PWR_UNPLUGGED          0x02

/** notification event parameter for Player Application setting change */
typedef struct
{
    uint8_t         num_attr;	/**< number of attributes*/
    uint8_t 		len;		/**< length of the list of attribute*/
    uint8_t 		*p_attrs;	/**< list of the attribute*/
} wiced_bt_avrc_player_app_param_t;

/** AVRCP notification response */
typedef union
{
    wiced_bt_avrc_playstate_t           play_status;    /**< play status*/
    wiced_bt_avrc_uid_t                 track;          /**< track id*/
    uint32_t                            play_pos;       /**< playback position*/
    wiced_bt_avrc_battery_status_t      battery_status; /**< battery status*/
    wiced_bt_avrc_systemstate_t         system_status;  /**< system status*/
    wiced_bt_avrc_player_app_param_t    player_setting; /**< player application settings*/
    wiced_bt_avrc_addr_player_param_t   addr_player;    /**< Addressed player properties*/
    uint16_t                            uid_counter;    /**< uid counter*/
    uint8_t                             volume;         /**< volume level*/
} wiced_bt_avrc_notif_rsp_param_t;

/** RegNotify response*/
typedef struct
{
    uint8_t                event_id;            /**< event id which is registered*/
    wiced_bt_avrc_notif_rsp_param_t   param;    /**< interim response parameters*/
} wiced_bt_avrc_metadata_reg_notif_rsp_t;

/** AVRCP player item */
typedef struct
{
    uint16_t                        player_id;      /**< A unique identifier for this media player.*/
    uint8_t                         major_type;     /**< Use AVRC_PLAYER_MAJOR_TYPE_AUDIO, AVRC_PLAYER_MAJOR_TYPE_VIDEO, AVRC_PLAYER_MAJOR_TYPE_BC_AUDIO, or AVRC_PLAYER_MAJOR_TYPE_BC_VIDEO.*/
    uint32_t                        sub_type;       /**< Use AVRC_PLAYER_SUB_TYPE_NONE, AVRC_PLAYER_SUB_TYPE_AUDIO_BOOK, or AVRC_PLAYER_SUB_TYPE_PODCAST*/
    uint8_t                         play_status;    /**< Use AVRC_PLAYSTATE_STOPPED, AVRC_PLAYSTATE_PLAYING, AVRC_PLAYSTATE_PAUSED, AVRC_PLAYSTATE_FWD_SEEK,
                                                        AVRC_PLAYSTATE_REV_SEEK, or AVRC_PLAYSTATE_ERROR*/
    wiced_bt_avrc_feature_mask_t    features;       /**< Supported feature bit mask*/
    wiced_bt_avrc_full_name_t       name;           /**< The player name, name length and character set id.*/
} wiced_bt_avrc_item_player_t;

/**AVRCP folder item*/
typedef struct
{
    wiced_bt_avrc_uid_t             uid;            /**< The uid of this folder */
    uint8_t                         type;           /**< Use AVRC_FOLDER_TYPE_MIXED, AVRC_FOLDER_TYPE_TITLES,
                                                        AVRC_FOLDER_TYPE_ALNUMS, AVRC_FOLDER_TYPE_ARTISTS, AVRC_FOLDER_TYPE_GENRES,
                                                        AVRC_FOLDER_TYPE_PLAYLISTS, or AVRC_FOLDER_TYPE_YEARS.*/
    wiced_bool_t                    playable;       /**< TRUE, if the folder can be played. */
    wiced_bt_avrc_full_name_t       name;           /**< The folder name, name length and character set id. */
} wiced_bt_avrc_item_folder_t;

/** media element */
typedef struct
{
    wiced_bt_avrc_uid_t             uid;            /**< The uid of this media element item */
    uint8_t                         type;           /**< Use AVRC_MEDIA_TYPE_AUDIO or AVRC_MEDIA_TYPE_VIDEO. */
    wiced_bt_avrc_full_name_t       name;           /**< The media name, name length and character set id. */
    uint8_t                         attr_count;     /**< The number of attributes in p_attr_list */
    uint8_t                         attr_list_len; /**< Total length of the attribute_list */
    uint8_t                         *p_attr_list; 	/**< Attribute entry list of type @ref wiced_bt_avrc_attr_entry_t */
} wiced_bt_avrc_item_media_t;

/** AVRCP Browsable item i.e. Player/Folder/Media items*/
typedef struct
{
    uint8_t                         item_type;      /**< AVRC_ITEM_PLAYER, AVRC_ITEM_FOLDER, or AVRC_ITEM_MEDIA */
    uint8_t                         item_length;    /**< Total length of the AVRC item */
    union
    {
        wiced_bt_avrc_item_player_t player;         /**< The properties of a media player item.*/
        wiced_bt_avrc_item_folder_t folder;         /**< The properties of a folder item.*/
        wiced_bt_avrc_item_media_t  media;          /**< The properties of a media item.*/
    }u;                                             /**< AVRC item player/folder/media */
} wiced_bt_avrc_item_t;

/** SetBrowsedPlayer */
typedef struct
{
    uint16_t                uid_counter;	/**< uid counter*/
    uint32_t                num_items;		/**< number of items in root folder path of player */
    uint16_t                charset_id;		/**< character set id*/
    uint8_t                 folder_depth;	/**< folder depth*/
    uint8_t                 length;			/**< length of the folder list of root path*/
    uint8_t 				*p_folder_name; /**<  folder list of root path of type @ref wiced_bt_avrc_name_t*/
} wiced_bt_avrc_browse_set_br_player_rsp_t;

/** GetFolderItems */
typedef struct
{
    uint16_t                uid_counter;	/**< uid counter*/
    uint16_t                item_count;		/**< number of items in response*/
    uint16_t                length;			/**< length of the item list in response */
    uint8_t    				*item_list;  	/**< item_list in response of type @ref wiced_bt_avrc_item_t*/
} wiced_bt_avrc_browse_get_items_rsp_t;

/** ChangePath */
typedef struct
{
    uint32_t                num_items;	/**< number of items in new path */
} wiced_bt_avrc_browse_chg_path_rsp_t;

typedef wiced_bt_avrc_get_attrs_t wiced_bt_avrc_browse_get_attrs_rsp_t; /**< browsing getitemattributes */

/** Get Total Number of Items */
typedef struct
{
    uint16_t                uid_counter;	/**< uid counter*/
    uint32_t                num_items;		/**< number of items */
} wiced_bt_avrc_browse_num_of_items_rsp_t;

typedef  wiced_bt_avrc_browse_num_of_items_rsp_t wiced_bt_avrc_browse_search_rsp_t;/**< browsing search response */

/** AVRC Metadata response messages */
typedef struct {
    wiced_bt_avrc_metadata_hdr_t metadata_hdr; /**< AVRC response header */

    union
    {
        wiced_bt_avrc_metadata_get_caps_rsp_t              get_caps;               /**< GetCapability */
        wiced_bt_avrc_metadata_list_app_attr_rsp_t         list_app_attr;          /**< ListPlayerAppAttr */
        wiced_bt_avrc_metadata_list_app_values_rsp_t       list_app_values;        /**< ListPlayerAppValues */
        wiced_bt_avrc_metadata_get_cur_app_value_rsp_t     get_cur_app_val;        /**< GetCurAppValue */
        wiced_bt_avrc_metadata_get_app_attr_txt_rsp_t      get_app_attr_txt;       /**< GetAppAttrTxt */
        wiced_bt_avrc_metadata_get_app_attr_txt_rsp_t      get_app_val_txt;        /**< GetAppValueTxt */
        wiced_bt_avrc_metadata_get_element_attrs_rsp_t     get_elem_attrs;         /**< GetElemAttrs */
        wiced_bt_avrc_metadata_get_play_status_rsp_t       get_play_status;        /**< GetPlayStatus */
        wiced_bt_avrc_metadata_reg_notif_rsp_t             reg_notif;              /**< RegNotify */
        uint8_t                                            volume;                 /**< SetAbsoluteVolume */
        uint8_t                                            status;                 /**< SetAddressedPlayer */
        uint8_t                                            play_status;            /**< PlayItem, AddToNowPlaying */
        uint8_t                                            rejected_rsp;           /**< error code for rejected response */

    }u;/**< Avrc Metadata response type */
}wiced_bt_avrc_metadata_rsp_t;

/** AVRC Browse response messages */
typedef struct {
    uint8_t  pdu_id;        /**< pdu id */
    uint16_t param_len;     /**< response data length */
    uint8_t  status;        /**< status */
    union
    {
        wiced_bt_avrc_browse_set_br_player_rsp_t         set_browse_player;      /**< SetBrowsedPlayer */
        wiced_bt_avrc_browse_get_items_rsp_t             get_folder_items;       /**< GetFolderItems */
        wiced_bt_avrc_browse_chg_path_rsp_t              chg_path;               /**< ChangePath */
        wiced_bt_avrc_browse_get_attrs_rsp_t             get_attrs;              /**< GetItemAttrs */
        wiced_bt_avrc_browse_num_of_items_rsp_t          get_num_of_items;       /**< GetTotalNumberOfItems */
        wiced_bt_avrc_browse_search_rsp_t                search;                 /**< Search */
        uint8_t                                          reject;
    }u; /**< Browsing response */
} wiced_bt_avrc_browse_rsp_t;

/** AVRC Command  messages */
typedef struct {
    wiced_bt_avrc_hdr_t hdr;                            /**< AVRC command header */
    union {
        wiced_bt_avrc_unit_info_cmd_t unit;             /**< unit info command */
        wiced_bt_avrc_sub_unit_info_cmd_t sub_unit;     /**< subunit command */
        wiced_bt_avrc_pass_thru_cmd_t pass_thru;        /**< Passthrough command */
        wiced_bt_avrc_metadata_cmd_t metadata;          /**< Metadata command */
        wiced_bt_avrc_browse_cmd_t browse_cmd;          /**< Browse command */
    }type;/**< Avrc command type */
}wiced_bt_avrc_cmd_t;

/** AVRC response messages */
typedef struct {
    wiced_bt_avrc_hdr_t hdr;                            /**< AVRC command header */

    union {
        wiced_bt_avrc_unit_info_rsp_t     unit;         /**< unit info response */
        wiced_bt_avrc_sub_unit_info_rsp_t sub_unit;     /**< subunit response */
        wiced_bt_avrc_pass_thru_hdr_t     pass;         /**< Passthrough response */
        wiced_bt_avrc_metadata_rsp_t      metadata;     /**< vendor response */
        wiced_bt_avrc_browse_rsp_t        browse_rsp;   /**< Browse response */
    }type;  /**< AVRC response type */

}wiced_bt_avrc_rsp_t;


/**@} wicedbt */
/* @endcond*/

#ifdef __cplusplus
}
#endif
